{"pages":[{"url":"contact","text":"Dr. Colin McLear Email: mclear@unl.edu Dr. David Sanson Email: yer email","tags":"pages","title":"Contact"},{"url":"resources","text":"Philosophy Links Some links for research, and for writing good philosophical prose. Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy PhilPapers Philosophical Terms & Methods Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Academic Technology & Tools Links to tools we use for research and writing Markdown : Plaintext markup for easy writing Pandoc : File conversion Emacs : A superb (and free) text editor and writing/research platform If you want to get started with emacs you might take a look at my configuration file BibDesk : Reference manager for bib files (Free, OS X only) Skim : PDF reader & annotator (Free, OS X only) Zotero : A great free way to collect and manage references. Works well with bibtex via zotero better bibtex Git : Version control Github : Online storage and collaboration Kieran Healy's writing resources page Profhacker : Blog on teaching & technology The Programming Historian : Tutorials for aspiring digital humanists A useful list of OS X tools for humanities students","tags":"pages","title":"Resources"},{"url":"rachels-on-relativism.html","text":"There is no reason to think that there are any absolute moral truths. We can see this when we consider different cultural outlooks concerning what is morally required. For example, indigenous Inuit culture considered infanticide to be morally permissible in some situations. But modern American culture clearly thinks infanticide is always morally wrong. So what's morally right or wrong is just a matter of opinion, which can vary from culture to culture. (James Rachels, The Elements of Moral Theory )","tags":"texts","title":"Rachels on Relativism"},{"url":"van-inwagen-on-free-will.html","text":"Text There are, moreover, seemingly unanswerable arguments that, if they are correct, demonstrate that the existence of moral responsibility entails the existence of free will, and, therefore, if free will does not exist, moral responsibility does not exist either. It is, however, evident that moral responsibility does exist: if there were no such thing as moral responsibility nothing would be anyone's fault, and it is evident that there are states of affairs to which one can point and say, correctly, to certain people: That's your fault. (van Inwagen \"How to Think\") Sample Extraction If there were no such thing as moral responsibility, then no one would be at fault for anything But people do correctly fault others for performing certain kinds of actions ∴ There is moral responsibility If there were no free will, then there would be no moral responsibility There is moral responsibility (from 3) ∴ There is free will Schematization If ~A, then ~B B ∴ A (by 1, 2, modus tollens) If ~C then ~A A (from (3)) ∴ C (by 4,5, modus tollens)","tags":"texts","title":"Van Inwagen on Free Will"}]}